{
  "en": {
    "welcome": "Welcome to My Portfolio",
    "heroDescription": "My name is Leonidas Adrian Mendoza, I'm from El Salvador, I'm 24 years old and I graduated from the Catholic University of El Salvador in 2025. I am a passionate full-stack developer creating innovative web solutions.",
    "about": "About Me",
    "projects": "Projects",
    "skills": "Skills",
    "contact": "Contact",
    "myPortfolio": "My Portfolio",
    "aboutTitle": "About Me",
    "aboutDescription": "I am a passionate full-stack developer, focusing more on web development using different backend and frontend frameworks. In addition to having knowledge in networks, Android application development, databases, servers, cloud services (AWS), among others. I have one year of experience, I worked on a project for the 'Government Ethics Tribunal of El Salvador', where I worked as a developer on a Laravel and MySQL project. This portfolio is my other project and is built with Laravel and React.",
    "projectsTitle": "My Projects",
    "projectsDescription": "The first project I carried out at the government ethics tribunal, which consisted of two Laravel systems, one for inventory and the other for human resources. I cannot share the code due to confidentiality but I share some images of the inventory system",
    "skillsTitle": "My Skills",
    "skillsTitle2": "About My Skills",
    "skillsDescription": "I learn and adapt quickly in any environment, and I like to learn new technologies. I am a good listener, and I am always looking to improve my skills. I am interested in learning new technologies and learning to improve my web development skills.",
    "skillsTitle3": "Skills",
    "skillsInfo": [
      "Java",
      "Python",
      "JavaScript",
      "PHP",
      "C#",
      "Laravel",
      "Node.js",
      "React",
      "Django",
      "Advanced Knowledge in AI techniques and tools",
      "Experience in Frontend and Backend development",
      "MySQL",
      "SQL Server",
      "PostgreSQL",
      "MongoDB",
      "Knowledge of AWS and Azure platforms",
      "Knowledge of Cisco networks",
      "Windows Server and Linux server administration",
      "Android and IOS application development"
    ],
    "skillsTitle4": "Abilities",
    "skillsInfo2": [
      "Teamwork",
      "Effective communication",
      "Problem solving",
      "Critical thinking",
      "Time management",
      "Adaptability",
      "Creativity",
      "Attention to detail"
    ],
    "skillsTitle5": "Studies",
    "studies": [
      "Computer Systems Engineering - Catholic University of El Salvador (2020-2025)",
      "Participation in different hackathons, bootcamps and programming competitions",
      "Laravel Certification - Udemy (2025)"
    ],
    "certificatesTitle": "Certificates",
    "contactTitle": "Get in Contact"
  },
  "es": {
    "welcome": "Bienvenido a Mi Portafolio",
    "heroDescription": "Mi nombre es Leonidas Adrian Mendoza, soy de El Salvador, tengo 24 años y me gradue de la universidad Catolica de El Salvador en 2025. Soy desarrollador full-stack apasionado creando soluciones web innovadoras.",
    "about": "Sobre Mí",
    "projects": "Proyectos",
    "skills": "Habilidades",
    "contact": "Contacto",
    "myPortfolio": "Mi Portafolio",
    "aboutTitle": "Sobre Mí",
    "aboutDescription": "Soy desarrollador full-stack apasionado, me enfoco mas en el desarrollo web utiizando diferentes frameworks en backend y frontend. Ademas de tener conocimientos en redes, desarrollo de aplicaciones android, bases de datos, servidores, servicios en la nube (AWS), entre otros. Tengo un año de experiencia, trabaje un projecto para el ´Tribunal de etica gubernamental de El Salvador´, donde trabaje como desarrollador en un proyecto de Laravel y mysql. Este portafolio es mi otro proyecto y esta construido con Laravel y React.",
    "projectsTitle": "Mis Proyectos",
    "projectsDescription": "El primer proyecto lo realice en el tribunal de etica gubernamental, el cual consistia en dos sistemas en laravel, uno para los inventarios y el otro para recursos humanos. El codigo no lo puedo compartir por confidencialidad pero comparto unas imagenes del sistema de inventarios",
    "skillsTitle": "Mis Habilidades",
    "skillsTitle2": "Acerca de Mis Habilidades",
    "skillsDescription": "Aprendo y me adapto rapido en cualquier entorno, y me gusta aprender nuevas tecnologias. Soy un buen escuchador, y siempre estoy buscando mejorar mis habilidades. Estoy interesado en aprender nuevas tecnologias y aprender a mejorar mis habilidades en desarrollo web.",
    "skillsTitle3": "Habilidades",
    "skillsInfo": [
      "Java",
      "Python",
      "JavaScript",
      "PHP",
      "C#",
      "Laravel",
      "Node.js",
      "React",
      "Django",
      "Conocimientos Avanzados en técnicas y herramientas de IA",
      "Experiencia en desarrollo Frontend y Backend",
      "MySQL",
      "SQL Server",
      "PostgreSQL",
      "MongoDB",
      "Conocimientos en plataformas AWS y Azure",
      "Conocimientos en redes Cisco",
      "Administración de servidores Windows Server y Linux",
      "Desarrollo de aplicaciones Android y IOS"
    ],
    "skillsTitle4": "Destrezas",
    "skillsInfo2": [
      "Trabajo en equipo",
      "Comunicación efectiva",
      "Resolución de problemas",
      "Pensamiento crítico",
      "Gestión del tiempo",
      "Adaptabilidad",
      "Creatividad",
      "Atención al detalle"
    ],
    "skillsTitle5": "Estudios",
    "studies": [
      "Ingenieria en sistemas Informaticos - Universidad Catolica de El Salvador (2020-2025)",
      "Participacion en diferentes hackatones, bootcamps y competencias de programacion",
      "Certificacion de Laravel - Udemy (2025)"
    ],
    "certificatesTitle": "Certificados",
    "contactTitle": "Ponte en Contacto"
  }
}